Oxlip/nrf51-firmware/app/aura/ble.c
#include <string.h>
#include <nrf_gpio.h>
#include <ble.h>
#include <app_util.h>
#include <app_error.h>

#include <ble_uuids.h>
#include <ble_ss.h>
#include "board_conf.h"

ble_ss_t dimmer_ss;
ble_ss_t current_ss;

/** UUIDs to advertise.
 *
 *  Note - Remember to adjust ADV_BLE_SERVICE_COUNT in board_conf.h
 */
ble_uuid_t adv_uuids [] = {
    {BLE_DIMMER_SERVICE, BLE_UUID_TYPE_BLE},
    {BLE_CURRENT_SENSOR_SERVICE, BLE_UUID_TYPE_BLE}
};

void device_on_ble_evt(ble_evt_t * p_ble_evt)
{
    ble_ss_on_ble_evt(&dimmer_ss, p_ble_evt);
    ble_ss_on_ble_evt(&current_ss, p_ble_evt);
}


static void ble_dimmer_write_event(ble_ss_t * p_ss, ble_gatts_evt_write_t * p_evt_write, ble_ss_evt_t * p_evt) 
{
    if (p_evt_write->data[1] == 0) {
        nrf_gpio_pin_clear(CONNECTED_LED_PIN_NO);
    } else {
        nrf_gpio_pin_set(CONNECTED_LED_PIN_NO);
    }
}

uint32_t services_init(void)
{
    uint32_t err_code;
    ble_uuid_t ble_uuid;
    ble_ss_init_t dimmer_param, cs_param;
    
    // Initialize Dimmer Service.
    memset(&dimmer_param, 0, sizeof(dimmer_param));

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dimmer_param.sensor_value_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dimmer_param.sensor_value_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dimmer_param.sensor_value_char_attr_md.write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dimmer_param.sensor_value_report_read_perm);

    dimmer_param.evt_handler          = ble_dimmer_write_event;
    dimmer_param.support_notification = true;
    dimmer_param.p_report_ref         = NULL;
    dimmer_param.initial_value        = 0;

    BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_DIMMER_SERVICE);
    err_code = ble_ss_init(&dimmer_ss, &ble_uuid, &dimmer_param);
    APP_ERROR_CHECK(err_code);

    // Initialize Current Sensor Service.
    memset(&cs_param, 0, sizeof(cs_param));

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cs_param.sensor_value_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cs_param.sensor_value_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&cs_param.sensor_value_char_attr_md.write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cs_param.sensor_value_report_read_perm);

    cs_param.evt_handler          = NULL;
    cs_param.support_notification = true;
    cs_param.p_report_ref         = NULL;
    cs_param.initial_value        = 0;

    BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_CURRENT_SENSOR_SERVICE);
    err_code = ble_ss_init(&dimmer_ss, &ble_uuid, &cs_param);
    APP_ERROR_CHECK(err_code);

    return NRF_SUCCESS;
}
